{
	"version": "https://jsonfeed.org/version/1",
	"title": "Aaron’s Microblog",
	"icon": "https://micro.blog/Rongwrong/avatar.jpg",
	"home_page_url": "https://rongwrong.micro.blog/",
	"feed_url": "https://rongwrong.micro.blog/feed.json",
	"items": [
		
			{
				"id": "http://rongwrong.micro.blog/2022/12/16/interesting-point-by.html",
				
				"content_html": "<p>Interesting point by Tanisha Fazal in a podcast interview about her latest book:</p>\n<p>An unintended consequence of international humanitarian law is that states are more reluctant to sign peace treaties. Treaties acknowledge there <em>was</em> a war, hence liability for prosecution under IHL.</p>\n",
				"content_text": "Interesting point by Tanisha Fazal in a podcast interview about her latest book:\n\nAn unintended consequence of international humanitarian law is that states are more reluctant to sign peace treaties. Treaties acknowledge there _was_ a war, hence liability for prosecution under IHL.\n",
				"date_published": "2022-12-16T15:02:23+02:00",
				"url": "https://rongwrong.micro.blog/2022/12/16/interesting-point-by.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/12/09/heres-a-short.html",
				
				"content_html": "<p>Here’s a short post (for myself, I don’t expect anyone else to read it) about Ruth Millikan’s concept of proper function. Very roughly: A proper function of something is a function performed by its ancestors that helps explain why that thing exists. So a proper function of a heart is to pump blood. But it seems to me that given the “precariousness of existence” of organisms, the proper function of an individual body part or behavior is pretty insignificant!</p>\n<p>In <em>Language, Thought and other Biological Categories</em> Millikan defines a proper function as follows. The definition uses terms she’s defined previously, but you can get the gist of it even without seeing the previous definitions.</p>\n<blockquote>\n<p>Where <em>m</em> is a member of a reproductively established family <em>R</em> and <em>R</em> has the reproductively established or Normal character <em>C, m</em> has the function <em>F</em> as a direct proper function iff:</p>\n</blockquote>\n<blockquote>\n<p>(1) Certain ancestors of <em>m</em> performed <em>F</em>.</p>\n</blockquote>\n<blockquote>\n<p>(2) In part because there existed a direct causal connection between having the character <em>C</em> and performance of the function <em>F</em> in the case of these ancestors of <em>m</em>, <em>C</em> correlated positively with <em>F</em> over a certain set of items <em>S</em> which included here ancestors and other things not having <em>C</em>.</p>\n</blockquote>\n<blockquote>\n<p>(3) One among the legitimate explanations that can be given of the fact that <em>m</em> exists makes reference to the fact that <em>C</em> correlated positively with <em>F</em> over <em>S</em>, either directly causing reproduction or <em>m</em> or explaining why <em>R</em> was proliferated and hence why <em>m</em> exists.</p>\n</blockquote>\n<p>In the next paragraph she says that hearts have direct proper functions, provided our guesses about their evolution are correct. Here <em>m</em> would be the heart in a given organism, <em>R</em> I guess would be the family of hearts in the organism’s lineage, <em>F</em> might be pumping blood, and then <em>C</em> would be the reproducible (genetic) properties of members of <em>R</em> that cause (some of) them to pump blood.</p>\n<p>The problem I think is in (3). This is where the “precariousness of existence” comes in, as discussed by Derek Parfit and others. A given organism conceived of two gametes is <em>essentially</em> the organism conceived of <em>those very two</em> gametes. Different sperm and egg, different organism. Thus an organism’s existence is “precarious”: if its conception had occurred at any other moment, it would probably have involved a different pair of gametes, hence that individual organism would never have existed.</p>\n<p>So if your distant ancestor’s heart had never pumped blood, you wouldn’t exist, so your heart wouldn’t exist either. So far, so good. But what if that distant, ocean-dwelling ancestor’s heart had pumped blood <em>better</em> than it actually did, enough to measurably change that ancestor’s life? Also then, you and your heart very likely wouldn’t exist!</p>\n<p>Now consider Millikan’s condition (3) and the correlation of <em>C</em> with <em>F</em>. Yes, the fact that it’s positive explains “why <em>R</em> was proliferated and hence why <em>m</em> exists.” If your ancestors’ hearts had pumped blood less effectively than their evolutionary competitors’, <em>R</em> might not have proliferated. But if the correlation were <em>greater</em> than it actually was, <em>R</em> would have proliferated <em>differently</em> and again, because of the “precariousness of existence”, you and your heart would not exist.</p>\n<p>In other words, it’s not only the fact that (roughly speaking) <em>C</em> has caused <em>F</em> per se that explains <em>m</em>’s existence. That’s a true partial explanation but a misleading one. It’s rather the fact that <em>C</em> correlated with <em>F</em> <em>exactly</em> as it actually did, not worse and <em>not better</em> either! So the explanation in condition (3) seems true but insignificantly so, because of the precariousness of <em>m</em>’s existence.</p>\n",
				"content_text": "Here’s a short post (for myself, I don’t expect anyone else to read it) about Ruth Millikan’s concept of proper function. Very roughly: A proper function of something is a function performed by its ancestors that helps explain why that thing exists. So a proper function of a heart is to pump blood. But it seems to me that given the “precariousness of existence” of organisms, the proper function of an individual body part or behavior is pretty insignificant!\n\n\nIn _Language, Thought and other Biological Categories_ Millikan defines a proper function as follows. The definition uses terms she’s defined previously, but you can get the gist of it even without seeing the previous definitions.\n\n\n> Where _m_ is a member of a reproductively established family _R_ and _R_ has the reproductively established or Normal character _C, m_ has the function _F_ as a direct proper function iff:\n\n> (1) Certain ancestors of _m_ performed _F_.\n\n> (2) In part because there existed a direct causal connection between having the character _C_ and performance of the function _F_ in the case of these ancestors of _m_, _C_ correlated positively with _F_ over a certain set of items _S_ which included here ancestors and other things not having _C_.\n\n> (3) One among the legitimate explanations that can be given of the fact that _m_ exists makes reference to the fact that _C_ correlated positively with _F_ over _S_, either directly causing reproduction or _m_ or explaining why _R_ was proliferated and hence why _m_ exists.\n\n\nIn the next paragraph she says that hearts have direct proper functions, provided our guesses about their evolution are correct. Here _m_ would be the heart in a given organism, _R_ I guess would be the family of hearts in the organism’s lineage, _F_ might be pumping blood, and then _C_ would be the reproducible (genetic) properties of members of _R_ that cause (some of) them to pump blood.\n\n\nThe problem I think is in (3). This is where the “precariousness of existence” comes in, as discussed by Derek Parfit and others. A given organism conceived of two gametes is _essentially_ the organism conceived of _those very two_ gametes. Different sperm and egg, different organism. Thus an organism’s existence is “precarious”: if its conception had occurred at any other moment, it would probably have involved a different pair of gametes, hence that individual organism would never have existed.\n\n\nSo if your distant ancestor’s heart had never pumped blood, you wouldn’t exist, so your heart wouldn’t exist either. So far, so good. But what if that distant, ocean-dwelling ancestor’s heart had pumped blood _better_ than it actually did, enough to measurably change that ancestor’s life? Also then, you and your heart very likely wouldn’t exist!\n\n\nNow consider Millikan’s condition (3) and the correlation of _C_ with _F_. Yes, the fact that it’s positive explains “why _R_ was proliferated and hence why _m_ exists.” If your ancestors’ hearts had pumped blood less effectively than their evolutionary competitors’, _R_ might not have proliferated. But if the correlation were _greater_ than it actually was, _R_ would have proliferated _differently_ and again, because of the “precariousness of existence”, you and your heart would not exist.\n\n\nIn other words, it’s not only the fact that (roughly speaking) _C_ has caused _F_ per se that explains _m_’s existence. That’s a true partial explanation but a misleading one. It’s rather the fact that _C_ correlated with _F_ _exactly_ as it actually did, not worse and _not better_ either! So the explanation in condition (3) seems true but insignificantly so, because of the precariousness of _m_’s existence.\n",
				"date_published": "2022-12-09T17:23:03+02:00",
				"url": "https://rongwrong.micro.blog/2022/12/09/heres-a-short.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/12/03/me-write-a.html",
				
				"content_html": "<p>Me: Write a typical micro.blog post</p>\n<p>GPT-3:</p>\n<blockquote>\n<p>Hey everyone! Today was a great day. I had the chance to get some fresh air and go for a nice long walk. It was a great way to clear my head and enjoy some time outside. Hope everyone had a great day too! #goodvibes #positivethoughts</p>\n</blockquote>\n",
				"content_text": "Me: Write a typical micro.blog post \n\nGPT-3:\n> Hey everyone! Today was a great day. I had the chance to get some fresh air and go for a nice long walk. It was a great way to clear my head and enjoy some time outside. Hope everyone had a great day too! #goodvibes #positivethoughts\n",
				"date_published": "2022-12-03T15:58:31+02:00",
				"url": "https://rongwrong.micro.blog/2022/12/03/me-write-a.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/12/03/im-not-sure.html",
				
				"content_html": "<p>I’m not sure GPT-3 really understands the concept of parody.</p>\n<p>Write a parody of “Dulce et Decorum Est” by Wilfred Owen.</p>\n<blockquote>\n<p>Dulce et Decorum Est,\nTo laugh and joke and jest,\nTo make a fool of life,\nAnd never take a rest.</p>\n</blockquote>\n<blockquote>\n<p>The gas and bombs and shells,\nThe trenches and the smells,\nThe mud and blood and gore,\nWe laugh and laugh some more.</p>\n</blockquote>\n<blockquote>\n<p>The soldiers in the line,\nTheir faces so sublime,\nTheir eyes so full of fear,\nWe laugh and laugh and jeer.</p>\n</blockquote>\n<blockquote>\n<p>The generals in their tents,\nTheir orders so intense,\nThe plans they make so grand,\nWe laugh and laugh and stand.</p>\n</blockquote>\n<blockquote>\n<p>The war that never ends,\nThe battles that transcend,\nThe death and pain and strife,\nWe laugh and laugh for life.</p>\n</blockquote>\n",
				"content_text": "I’m not sure GPT-3 really understands the concept of parody.\n\nWrite a parody of “Dulce et Decorum Est” by Wilfred Owen.\n\n>Dulce et Decorum Est,\n>To laugh and joke and jest,\n>To make a fool of life,\n>And never take a rest.\n\n>The gas and bombs and shells,\nThe trenches and the smells,\nThe mud and blood and gore,\nWe laugh and laugh some more.\n \n>The soldiers in the line,\nTheir faces so sublime,\nTheir eyes so full of fear,\nWe laugh and laugh and jeer.\n\n>The generals in their tents,\nTheir orders so intense,\nThe plans they make so grand,\nWe laugh and laugh and stand.\n\n>The war that never ends,\nThe battles that transcend,\nThe death and pain and strife,\nWe laugh and laugh for life.\n",
				"date_published": "2022-12-03T14:03:34+02:00",
				"url": "https://rongwrong.micro.blog/2022/12/03/im-not-sure.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/12/02/muriel-spark-ive.html",
				
				"content_html": "<p>Muriel Spark 📚 I’ve read, ranked (not to be taken seriously):</p>\n<ol>\n<li>The Prime of Miss Jean Brodie</li>\n<li>Loitering with Intent</li>\n<li>The Girls of Slender Means</li>\n<li>The Mandelbaum Gate</li>\n<li>The Driver’s Seat</li>\n<li>The Public Image</li>\n<li>A Far Cry From Kensington</li>\n<li>Memento Mori</li>\n<li>Not to Disturb</li>\n</ol>\n",
				"content_text": "Muriel Spark 📚 I’ve read, ranked (not to be taken seriously):\n\n1. The Prime of Miss Jean Brodie\n2. Loitering with Intent\n3. The Girls of Slender Means\n4. The Mandelbaum Gate\n5. The Driver’s Seat\n6. The Public Image\n7. A Far Cry From Kensington\n8. Memento Mori\n9. Not to Disturb \n",
				"date_published": "2022-12-02T15:10:47+02:00",
				"url": "https://rongwrong.micro.blog/2022/12/02/muriel-spark-ive.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/12/02/i-live-near.html",
				
				"content_html": "<p>I live near a daycare center. I really enjoy the sound of little children playing, knowing that someone else is responsible for watching them.</p>\n<p>It’s like that wonderful feeling a new parent gets when he hears someone else’s child crying and it registers, “Not my responsibility!”</p>\n",
				"content_text": "I live near a daycare center. I really enjoy the sound of little children playing, knowing that someone else is responsible for watching them.\n\nIt’s like that wonderful feeling a new parent gets when he hears someone else’s child crying and it registers, “Not my responsibility!”\n",
				"date_published": "2022-12-02T11:19:29+02:00",
				"url": "https://rongwrong.micro.blog/2022/12/02/i-live-near.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/29/chantal-mouffe-on.html",
				"title": "Chantal Mouffe on the moralizing “good democrats”",
				"content_html": "<p>This is well said by Chantal Mouffe on the “good democrats” who substitute moralizing for politics in their response to what they call the “extreme right”. Published in 2005, obviously drawing on Carl Schmitt, still very relevant today.</p>\n<blockquote>\n<p>As we saw earlier, the dominant discourse announces the end of the adversarial model of politics and the advent of a consensual politics beyond left and right. However, politics always entails an us/ them distinction. This is why the consensus advocated by the defenders of the ‘non-partisan democracy’ cannot exist without drawing a frontier and defining an exterior, a &lsquo;them&rsquo; which assures the identity of the consensus and secures the coherence of the ‘us'. To put it in another way, the consensus at the centre, which is supposed to include everybody in our post-political societies, cannot exist without the establishment of a frontier, because no consensus - or no common identity, for that matter - can exist without a frontier. There cannot be an &lsquo;us&rsquo; without a &lsquo;them&rsquo;, and the very identity of a group depends on the existence of a &lsquo;constitutive outside’. So the us of the ‘good democrats&rsquo; needs to be secured by the determination of a &lsquo;them&rsquo;. Nowadays the ‘them' is provided by what is designated as the &lsquo;extreme right’. This term is used in a very undefined way to refer to an amalgam of groups and parties whose characteristics and objectives are extremely diverse and it covers a wide spectrum which goes from fringe groups of extremists, skinheads and neo-nazis to the authoritarian right and a variety of right-wing populist parties.</p>\n</blockquote>\n<blockquote>\n<p>Such a heterogeneous construct is of course useless to grasp the nature and causes of the new forms of right-wing politics. But it is very useful to secure the identity of the &lsquo;good democrats’ and to procure a positive image of the post-political consensus. It is clear that, since politics has supposedly become &lsquo;non-adversarial&rsquo;, the &lsquo;them&rsquo; which is necessary to make possible the &lsquo;us&rsquo; of the good democrats cannot be envisaged as a political adversary, and the frontier has to be drawn in the moral register. So, to draw the frontier between the &lsquo;good democrats and the &lsquo;evil extreme-right&rsquo; is very convenient, since the them&rsquo; can now be considered as a sort of moral disease which needs to be condemned morally, not fought politically. This is why no attempt is made to try to understand the reasons for its existence - an understanding, in any case, made impossible by the amalgam on which the very notion of &lsquo;extreme-right&rsquo; is based. Moreover, attempts at understanding are deemed suspect, and perceived as a move towards condoning something which is morally unacceptable. As a consequence, moral condemnation and the establishment of a cordon sanitaire have become the dominant answers to the rise of right-wing populist movements.</p>\n</blockquote>\n<blockquote>\n<p>The increasing moralisation of political discourse that we are witnessing goes hand in hand with the dominant post-political perspective. Far from indicating a new stage in the triumphant march of democracy, such a phenomenon represents a very negative development. Let&rsquo;s not misunderstand my point. It is not my intention to defend Realpolitik and to deny that normative concerns should play a role in politics. But there is a big difference between morality and moralism, which limits itself to the denunciation of evil in others. Yet today&rsquo;s good democrats are so confident that they have the truth, and that their mission is to impose it on others, that they refuse to engage in debate with those who disagree.</p>\n</blockquote>\n<blockquote>\n<p>It is no doubt easier to present them as a moral enemy, to be destroyed and eradicated, instead of having to envisage them as adversaries in the political terrain.</p>\n</blockquote>\n",
				"content_text": "This is well said by Chantal Mouffe on the “good democrats” who substitute moralizing for politics in their response to what they call the “extreme right”. Published in 2005, obviously drawing on Carl Schmitt, still very relevant today. \n\n> As we saw earlier, the dominant discourse announces the end of the adversarial model of politics and the advent of a consensual politics beyond left and right. However, politics always entails an us/ them distinction. This is why the consensus advocated by the defenders of the ‘non-partisan democracy’ cannot exist without drawing a frontier and defining an exterior, a 'them' which assures the identity of the consensus and secures the coherence of the ‘us'. To put it in another way, the consensus at the centre, which is supposed to include everybody in our post-political societies, cannot exist without the establishment of a frontier, because no consensus - or no common identity, for that matter - can exist without a frontier. There cannot be an 'us' without a 'them', and the very identity of a group depends on the existence of a 'constitutive outside’. So the us of the ‘good democrats' needs to be secured by the determination of a 'them'. Nowadays the ‘them' is provided by what is designated as the 'extreme right’. This term is used in a very undefined way to refer to an amalgam of groups and parties whose characteristics and objectives are extremely diverse and it covers a wide spectrum which goes from fringe groups of extremists, skinheads and neo-nazis to the authoritarian right and a variety of right-wing populist parties.\n\n> Such a heterogeneous construct is of course useless to grasp the nature and causes of the new forms of right-wing politics. But it is very useful to secure the identity of the 'good democrats’ and to procure a positive image of the post-political consensus. It is clear that, since politics has supposedly become 'non-adversarial', the 'them' which is necessary to make possible the 'us' of the good democrats cannot be envisaged as a political adversary, and the frontier has to be drawn in the moral register. So, to draw the frontier between the 'good democrats and the 'evil extreme-right' is very convenient, since the them' can now be considered as a sort of moral disease which needs to be condemned morally, not fought politically. This is why no attempt is made to try to understand the reasons for its existence - an understanding, in any case, made impossible by the amalgam on which the very notion of 'extreme-right' is based. Moreover, attempts at understanding are deemed suspect, and perceived as a move towards condoning something which is morally unacceptable. As a consequence, moral condemnation and the establishment of a cordon sanitaire have become the dominant answers to the rise of right-wing populist movements.\n\n> The increasing moralisation of political discourse that we are witnessing goes hand in hand with the dominant post-political perspective. Far from indicating a new stage in the triumphant march of democracy, such a phenomenon represents a very negative development. Let's not misunderstand my point. It is not my intention to defend Realpolitik and to deny that normative concerns should play a role in politics. But there is a big difference between morality and moralism, which limits itself to the denunciation of evil in others. Yet today's good democrats are so confident that they have the truth, and that their mission is to impose it on others, that they refuse to engage in debate with those who disagree.\n\n\n> It is no doubt easier to present them as a moral enemy, to be destroyed and eradicated, instead of having to envisage them as adversaries in the political terrain.\n",
				"date_published": "2022-11-29T20:12:37+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/29/chantal-mouffe-on.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/24/the-other-day.html",
				
				"content_html": "<p>“The other day a Ukrainian TV station contacted me and asked me whether we could do an interview about what spending one’s life in the shadow of a large and aggressive neighbor is like.”</p>\n<p>Interesting <a href=\"http://www.martin-van-creveld.com/next-to-the-bear/\">post by military historian Martin van Creveld</a>. Wish he’d write more on it!</p>\n",
				"content_text": "“The other day a Ukrainian TV station contacted me and asked me whether we could do an interview about what spending one’s life in the shadow of a large and aggressive neighbor is like.”\n\nInteresting [post by military historian Martin van Creveld](http://www.martin-van-creveld.com/next-to-the-bear/). Wish he’d write more on it!\n",
				"date_published": "2022-11-24T17:48:48+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/24/the-other-day.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/24/so-this-thing.html",
				
				"content_html": "<p>So this thing about the smell called “zankha” is going around Twitter. I think I’ve noticed it too!</p>\n<p>I never really paid attention to it though. Dunno if I can detect it reliably, maybe gotta do some blind experiments.</p>\n<p>Also 23andMe says I’m 1.2% Levantine. Hmm…🤔</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "So this thing about the smell called “zankha” is going around Twitter. I think I’ve noticed it too!\n\nI never really paid attention to it though. Dunno if I can detect it reliably, maybe gotta do some blind experiments.\n\nAlso 23andMe says I’m 1.2% Levantine. Hmm…🤔\n\n<img src=\"uploads/2022/30eb927477.jpg\" width=\"600\" height=\"600\" alt=\"\">\n",
				"date_published": "2022-11-24T05:30:07+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/24/so-this-thing.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/23/this-might-seem.html",
				
				"content_html": "<p>This might seem like a weird connection, but this morning’s terrorist attack in Jerusalem reminded me of some of my objections to <a href=\"https://harpers.org/archive/2022/12/between-chaos-and-the-man-the-dawn-of-everything-graeber-wengrow-the-dispossessed-ursula-k-le-guin/\">Alan Jacobs’ recent essay on anarchism</a>. What new is there to say about a terrorist attack? So I’ll talk about this instead.</p>\n<p>I think Jacobs slides over objections to anarchism way too glibly. One example is the point about anarchist society being less productive. Discussing Ursula K. LeGuin’s <em>The Dispossessed</em>, he writes,</p>\n<blockquote>\n<p>It is easy and partly correct to say that the resource-poor environment of Anarres ensured that its residents would live simply; but it is equally true to say that simplicity was what the Odonians preferred. They stood a better chance of adhering to that preference, and of remaining anarchist, on a world that never tempted them with a lush life and (therefore) a more differentiated social order. Ample natural resources and hierarchical political structures—such as existed on Urras, especially in the nation called A-Io—lead to innovation and productivity; but they also lead to inequality, injustice, and the exploitation of the world and its creatures, including its human creatures.</p>\n</blockquote>\n<blockquote>\n<p>Every social order comes with trade-offs. The Odonians of Anarres know they have given up comforts that those on Urras would deem necessities. Most of them warmly accept those sacrifices, and indeed don’t think of them as sacrifices, because they believe themselves to be amply compensated by their freedom and egalitarian social solidarity.</p>\n</blockquote>\n<p>My first thought when I read that a few days ago was that the innovation and productivity he’s willing to sacrifice don’t just lead to a “lush life.” They also lead to life-saving and life-enhancing medical technology, for instance.</p>\n<p>But today I’m thinking the important thing is that without hierarchical political structures, we here would have <em>no</em> life: no existence as an independent community at all, and many of us as individuals would be killed. Hierarchical political–economic structures, and the hierarchical military structures that accompany them, are an absolutely crucial condition of our existence.</p>\n<p>This isn’t my only objection to the essay by any means. But it’s the one that came to mind after today’s terrorist attack. Like Jacobs, I also believed in anarchism as a teenager. I read the same books as he did at the same age as he did, so I think I understand where he’s coming from. But the closer we were to move towards anarchism, the more we would endanger our existence.</p>\n",
				"content_text": "This might seem like a weird connection, but this morning’s terrorist attack in Jerusalem reminded me of some of my objections to [Alan Jacobs’ recent essay on anarchism](https://harpers.org/archive/2022/12/between-chaos-and-the-man-the-dawn-of-everything-graeber-wengrow-the-dispossessed-ursula-k-le-guin/). What new is there to say about a terrorist attack? So I’ll talk about this instead.\n\nI think Jacobs slides over objections to anarchism way too glibly. One example is the point about anarchist society being less productive. Discussing Ursula K. LeGuin’s _The Dispossessed_, he writes,\n\n> It is easy and partly correct to say that the resource-poor environment of Anarres ensured that its residents would live simply; but it is equally true to say that simplicity was what the Odonians preferred. They stood a better chance of adhering to that preference, and of remaining anarchist, on a world that never tempted them with a lush life and (therefore) a more differentiated social order. Ample natural resources and hierarchical political structures—such as existed on Urras, especially in the nation called A-Io—lead to innovation and productivity; but they also lead to inequality, injustice, and the exploitation of the world and its creatures, including its human creatures.\n\n> Every social order comes with trade-offs. The Odonians of Anarres know they have given up comforts that those on Urras would deem necessities. Most of them warmly accept those sacrifices, and indeed don’t think of them as sacrifices, because they believe themselves to be amply compensated by their freedom and egalitarian social solidarity. \n\nMy first thought when I read that a few days ago was that the innovation and productivity he’s willing to sacrifice don’t just lead to a “lush life.” They also lead to life-saving and life-enhancing medical technology, for instance.\n\nBut today I’m thinking the important thing is that without hierarchical political structures, we here would have _no_ life: no existence as an independent community at all, and many of us as individuals would be killed. Hierarchical political–economic structures, and the hierarchical military structures that accompany them, are an absolutely crucial condition of our existence.\n\nThis isn’t my only objection to the essay by any means. But it’s the one that came to mind after today’s terrorist attack. Like Jacobs, I also believed in anarchism as a teenager. I read the same books as he did at the same age as he did, so I think I understand where he’s coming from. But the closer we were to move towards anarchism, the more we would endanger our existence.\n",
				"date_published": "2022-11-23T09:28:20+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/23/this-might-seem.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/21/obligatory-sunset-pic.html",
				
				"content_html": "<p>Obligatory sunset pic</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Obligatory sunset pic\n\n<img src=\"uploads/2022/5b28066263.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2022-11-21T16:58:11+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/21/obligatory-sunset-pic.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/20/as-a-new.html",
				
				"content_html": "<p>As a new user I really like micro.blog, but also this is a wonderful <a href=\"https://spectatorworld.com/topic/in-defense-of-twitter/\">defense of Twitter</a> by Ben Sixsmith</p>\n",
				"content_text": "As a new user I really like micro.blog, but also this is a wonderful [defense of Twitter](https://spectatorworld.com/topic/in-defense-of-twitter/) by Ben Sixsmith\n",
				"date_published": "2022-11-20T07:09:33+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/20/as-a-new.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/19/looking-at-all.html",
				
				"content_html": "<p>Looking at all those photos people post on micro.blog reminds me that I&rsquo;ve never even been to New England</p>\n",
				"content_text": "Looking at all those photos people post on micro.blog reminds me that I've never even been to New England\n",
				"date_published": "2022-11-19T06:57:41+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/19/looking-at-all.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/18/some-movies-i.html",
				
				"content_html": "<p>Some movies I thought were Good Actually (not guilty pleasures) even though they got bad reviews. What are some others? 🍿</p>\n<p>The Counselor (2013)\nSpring Breakers (2013)\nYear of the Gun (1991)\nThis is 40 (2012)</p>\n<p>The first two I think lots of film critics simply misunderstood.</p>\n",
				"content_text": "Some movies I thought were Good Actually (not guilty pleasures) even though they got bad reviews. What are some others? 🍿 \n\nThe Counselor (2013)\nSpring Breakers (2013)\nYear of the Gun (1991)\nThis is 40 (2012)\n\nThe first two I think lots of film critics simply misunderstood.\n",
				"date_published": "2022-11-18T17:12:49+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/18/some-movies-i.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/16/meir-sternberg-was.html",
				
				"content_html": "<p><a href=\"https://www.amazon.com/Poetics-Biblical-Narrative-Ideological-Literature/dp/0253204534\">Meir Sternberg</a> was right and <a href=\"https://www.amazon.com/Art-Biblical-Narrative-Robert-Alter/dp/0465022553\">Robert Alter</a> was wrong: The difference between fiction and non-fiction is truth <em>claim</em>.</p>\n<p>Biblical narrative is non-fiction because it <em>claims</em> to be true, regardless of whether it is actually true. It&rsquo;s a simple, single criterion.📚</p>\n",
				"content_text": "[Meir Sternberg](https://www.amazon.com/Poetics-Biblical-Narrative-Ideological-Literature/dp/0253204534) was right and [Robert Alter](https://www.amazon.com/Art-Biblical-Narrative-Robert-Alter/dp/0465022553) was wrong: The difference between fiction and non-fiction is truth _claim_.\n\nBiblical narrative is non-fiction because it _claims_ to be true, regardless of whether it is actually true. It's a simple, single criterion.📚 \n",
				"date_published": "2022-11-16T08:24:07+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/16/meir-sternberg-was.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/15/interesting-post-by.html",
				
				"content_html": "<p>Interesting <a href=\"https://richardhanania.substack.com/p/the-overman-cuts-people-off-in-traffic\">post by Richard Hanania on early and late mergers in traffic</a>. He gives three reasons for early merging. The third applies to me: social conformity/cowardice.</p>\n<p>But what I fear is people <em>wrongly</em> thinking I’m selfish/antisocial when I haven’t been, not when I have been.</p>\n",
				"content_text": "Interesting [post by Richard Hanania on early and late mergers in traffic](https://richardhanania.substack.com/p/the-overman-cuts-people-off-in-traffic). He gives three reasons for early merging. The third applies to me: social conformity/cowardice.\n\nBut what I fear is people _wrongly_ thinking I’m selfish/antisocial when I haven’t been, not when I have been.\n",
				"date_published": "2022-11-15T16:17:01+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/15/interesting-post-by.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/14/microblog-in-the.html",
				
				"content_html": "<p>Micro.blog in the streets, Twitter in the sheets</p>\n",
				"content_text": "Micro.blog in the streets, Twitter in the sheets\n",
				"date_published": "2022-11-14T06:14:21+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/14/microblog-in-the.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/12/102817.html",
				
				"content_html": "<p>Finished reading <a href=\"https://cup.columbia.edu/book/the-shape-of-sex/9780231551366\">The Shape of Sex: Nonbinary Gender from Genesis to the Renaissance</a> by Leah DeVun.</p>\n<p>Fascinating history of theological, medical, and social questions involved in classifying people by sex, as conceptions of sex evolved from late antiquity through the Middle Ages📚</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "Finished reading [The Shape of Sex: Nonbinary Gender from Genesis to the Renaissance](https://cup.columbia.edu/book/the-shape-of-sex/9780231551366) by Leah DeVun.\n\nFascinating history of theological, medical, and social questions involved in classifying people by sex, as conceptions of sex evolved from late antiquity through the Middle Ages📚\n\n\n<img src=\"uploads/2022/9ce24571ef.jpg\" width=\"350\" height=\"353\" alt=\"\">\n",
				"date_published": "2022-11-12T10:28:17+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/12/102817.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/12/heres-an-interesting.html",
				
				"content_html": "<p>Here’s an <a href=\"https://link.springer.com/epdf/10.1007/s10508-022-02467-5?sharing_token=gTPNUCpXVCqq7WzMU2n7_Pe4RwlQNchNByi7wbcMAY5rplxPSeiwUBnON7599x-nN5xQx3FeH6V32q5aqBxbVuS5DPZOVGgLXeaOlOZr6g9AUNJzY-ZzYeSxjDmC8pWV-eEP8Cf6sGBgLDN2wTMUE2QuuKXpbM2Z_ZjOphK9NwI=&amp;error=cookies_not_supported&amp;code=f86bdd87-822f-4e1f-aa30-9368441a90dc\">interesting article by Harvard biology lecturer Carole Hooven</a> on the hysterical reaction to comments she made about biological sex.</p>\n<p>I think Hooven’s conception of biological sex is wrong philosophically, but there’s no excuse for the reaction described in the article.</p>\n<p>Here’s the fundamental issue in the dispute, which is rarely stated explicitly: Hooven claims that her concept of sex, gamete type, is the <em>only</em> legitimate concept of sex. I don’t think anyone seriously denies that her concept is <em>a</em> legitimate concept of biological sex. Her opponents just argue there are other legitimate sex concepts as well (e.g., chromosomes).</p>\n<p>As far as I know, Hooven has never actually defended her claim, except once in her classroom, defending it against Harvard professor Sarah Richardson. Richardson argues for sex contextualism.</p>\n<p>And as far as I know, no other scientist or philosopher has defended that “monist” claim, either in print or on the internet. They just repeatedly assert it without argument.</p>\n<p>But none of that matters to the scandal at Harvard that’s described in the article, and which explains why Hooven is not currently teaching. There’s no excuse for suppressing her scholarly opinion.</p>\n",
				"content_text": "Here’s an [interesting article by Harvard biology lecturer Carole Hooven](https://link.springer.com/epdf/10.1007/s10508-022-02467-5?sharing_token=gTPNUCpXVCqq7WzMU2n7_Pe4RwlQNchNByi7wbcMAY5rplxPSeiwUBnON7599x-nN5xQx3FeH6V32q5aqBxbVuS5DPZOVGgLXeaOlOZr6g9AUNJzY-ZzYeSxjDmC8pWV-eEP8Cf6sGBgLDN2wTMUE2QuuKXpbM2Z_ZjOphK9NwI=&error=cookies_not_supported&code=f86bdd87-822f-4e1f-aa30-9368441a90dc) on the hysterical reaction to comments she made about biological sex.\n\nI think Hooven’s conception of biological sex is wrong philosophically, but there’s no excuse for the reaction described in the article.\n\nHere’s the fundamental issue in the dispute, which is rarely stated explicitly: Hooven claims that her concept of sex, gamete type, is the _only_ legitimate concept of sex. I don’t think anyone seriously denies that her concept is _a_ legitimate concept of biological sex. Her opponents just argue there are other legitimate sex concepts as well (e.g., chromosomes).\n\nAs far as I know, Hooven has never actually defended her claim, except once in her classroom, defending it against Harvard professor Sarah Richardson. Richardson argues for sex contextualism. \n\nAnd as far as I know, no other scientist or philosopher has defended that “monist” claim, either in print or on the internet. They just repeatedly assert it without argument.\n\nBut none of that matters to the scandal at Harvard that’s described in the article, and which explains why Hooven is not currently teaching. There’s no excuse for suppressing her scholarly opinion.\n",
				"date_published": "2022-11-12T09:31:51+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/12/heres-an-interesting.html"
			},
			{
				"id": "http://rongwrong.micro.blog/2022/11/11/085940.html",
				
				"content_html": "<p><em>Ride the High Country</em> (1962, dir. Sam Peckinpah) has gotta be one of the best Westerns ever. One of the few movies where the unequivocally good main character is just as deep and interesting as the morally ambiguous one. In <em>that</em> way even better than <em>The Wild Bunch</em>?🍿</p>\n<!-- raw HTML omitted -->\n",
				"content_text": "_Ride the High Country_ (1962, dir. Sam Peckinpah) has gotta be one of the best Westerns ever. One of the few movies where the unequivocally good main character is just as deep and interesting as the morally ambiguous one. In _that_ way even better than _The Wild Bunch_?🍿\n\n<img src=\"uploads/2022/abb40dcb21.jpg\" width=\"300\" height=\"169\" alt=\"\">\n",
				"date_published": "2022-11-11T08:59:40+02:00",
				"url": "https://rongwrong.micro.blog/2022/11/11/085940.html"
			}
	]
}
